// //Task1
// let life={
// dog:'Тайсон',
// person:{name:'Маркіян',age:18,},
// car:{brand:'Audi',color:'black'},
// apartment:'двох кімнатна квартира',
// book:'Гарі Потер',
// }
// console.log(life)
// //Task2
// let arr=['Тайсон','Діна','Чак','Саймон','Ларус','Бодя','Степан','Вася','Ростик','Каріна','Ауді','BMW','Мерседес','Порш','Ферарі' ]
// console.log(arr)
// //Task3
// let house={
//     подвіря:['сад','альтанка','гараж','басейн','мангал'],
//     розташування:{
//         місто:'Стрий',
//         вулиця :'Шумлявщина',
//         будинок: 15, 
//     },
//     колір:'персиковий',
// сусіди:'приємні в спілкуванні',
// }
// let driver={ 
//  вигляд:[' костюм','сорочка','галстук','окуляри','мешти'],
//  автомобіль:{
//      марка: 'Ауді',
//      колір:'чорний',
//      мотор:'3.0',
//      стан:'чудовий',
//  },
//  навики:'ідеально',
//  спілкування:'приємно розмовляти',
// }
// let doll={
// набір:['плаття','гребінь','черевики','аксесуари','сумка'],
// вигляд:{
// волосся:'чорне',
// шкіра:'темна',
// ріст:'60 см',
// національність:'азіатка',
// вік:20,
// },
// фірма:LEGO,
// дата:'14.01.2009р.'
// }
// let table={
//     матеріал:['скло','дерево','метал','сілікон','резина'],
//     вигляд:{
//         дерево:'червоне',
//         метал:'чугун',
//         скло:'пуле не пробивне',
//         ножки:4,
//         особливість:'вогнестійкий',
//     },
//     розмір:'4на2',
//     виробник:'Меблі стрий'
// }
// let bag={
//     матеріал:['шкіра змії','замок золотий','кишені льяні','ручки тканинні','оправа алмазна'],
//     Дані:{
//     фріма:'Chanel',
//     країна:'Італія',
//     ціна:'1000$',
//     колекція:'Animel planet',
//     доступно:'8 екземплярів'
//     },
//     магазин:'Prada',
//     розташування:'Києв вул.Хрищати 15'
    
// }
// // //Task4
//  let users = [
//      {name: 'vasya', age: 31, status: false},
//      {name: 'petya', age: 30, status: true},
//      {name: 'kolya', age: 29, status: true},
//      {name: 'olya', age: 28, status: false},
//      {name: 'max', age: 30, status: true},
//      {name: 'anya', age: 31, status: false},
//      {name: 'oleg', age: 28, status: false},
//      {name: 'andrey', age: 29, status: true},
//      {name: 'masha', age: 30, status: true},
//      {name: 'olya', age: 31, status: false},
//      {name: 'max', age: 31, status: true}
//  ]; 

// console.log(users[7].status)//1
// console.log(users[4].status)//2
// console.log(users[9].name)//3
// console.log(users[2].name)//4
// console.log(users[6].age)//5
// console.log(users[9].age)//6
// console.log(users[4].age+''+users[4].name)//7
// console.log(users[5].age+''+users[5].status)//8
//Task5
